import { CHAT } from './chatType';
import fortuneImage from '/public/static/images/fortune.png';

export const chatDogList = [
  {
    title: CHAT.FORTUNE,
    keyword: '운세',
    imgPath: fortuneImage,
    tag: ['#운세', '#사주', '#취업운', '#연애운', '#건강운', '#시험운', '#토정비결', '#신년운세'],
    explain: '귀여운 포춘독이 당신의 운세를 알려드립니다',
    sub: '운세 알려주는 신비로운 강아지 포춘독',
    detailtext: [
      '포춘독은 당신의 운명을 섬세하게 고민합니다. 과거와 미래가 걱정되는 당신에게 길을 제시해주고 불안했던 마음에 평화를 가져다 줍니다.',
      '귀여운 얼굴로 웃음짓게 하는 것은 덤 입니다 🤣',
      '당신의 생년월일이 있으면 더 정확한 점을 볼 수 있다고 합니다!',
    ],
  },
  //{
  //  title: CHAT.RECIPE,
  //  keyword: '레시피',
  //  imgPath: '/static/images/fortune.png',
  //  tag: ['#레시피', '#음식', '#요리', '#오늘 뭐먹지?'],
  //  explain: '레시피독은 이 세상 모든 요리법을 알고 있어요',
  //  sub: '운세 알려주는 신비로운 강아지 포춘독',
  //  detailtext: [
  //    '포춘독은 당신의 운명을 섬세하게 고민합니다. 과거와 미래가 걱정되는 당신에게 길을 제시해주고 불안했던 마음에 평화를 가져다 줍니다.',
  //    '귀여운 얼굴로 웃음짓게 하는 것은 덤 입니다!',
  //    '당신의 생년월일이 있으면 더 정확한 점을 볼 수 있다고 합니다!',
  //  ],
  //},
  //{
  //  title: CHAT.DIET,
  //  keyword: '식단',
  //  imgPath: '/static/images/fortune.png',
  //  tag: ['#다이어트', '#음식', '#요리', '#식단관리', '#체중감량'],
  //  explain: '다이어트독으로 당신의 식습관을 바꿔보세요',
  //  sub: '운세 알려주는 신비로운 강아지 포춘독',
  //  detailtext: [
  //    '포춘독은 당신의 운명을 섬세하게 고민합니다. 과거와 미래가 걱정되는 당신에게 길을 제시해주고 불안했던 마음에 평화를 가져다 줍니다.',
  //    '귀여운 얼굴로 웃음짓게 하는 것은 덤 입니다!',
  //    '당신의 생년월일이 있으면 더 정확한 점을 볼 수 있다고 합니다!',
  //  ],
  //},
];
